кафедра("М1-КФ",
 "М1-КФ",
 "Машиностроительные технологии"
).

кафедра("М2-КФ",
 "М2-КФ",
 "Сварка и диагностика"
).

кафедра("М3-КФ",
 "М3-КФ",
 "Тепловые двигатели и гидромашины"
).

кафедра("М4-КФ",
 "М4-КФ",
 "Инструментальная техника и инженерная графика"
).

кафедра("М6-КФ",
 "М6-КФ",
 "Колесные машины и прикладная механика"
).

кафедра("М7-КФ",
 "М7-КФ",
 "Мехатроника и робототехнические системы"
).

кафедра("М8-КФ",
 "М8-КФ",
 "Организация и управление производством"
).

кафедра("М9-КФ",
 "М9-КФ",
 "Подъемно-транспортные системы"
).
				
кафедра("a2eb4b01-82fc-1029-96dd-000347adedc6",
 "БМТ1",
 "Биомедицинские технические системы"
).
  
кафедра("a2edbe9b-82fc-1029-96dd-000347adedc6",
 "БМТ2",
 "Медико-технические информационные технологии"
).
  
кафедра("a2f0aef6-82fc-1029-96dd-000347adedc6",
 "БМТ4",
 "Медико-технический менеджмент"
).
  
кафедра("a2fa99db-82fc-1029-96dd-000347adedc6",
 "ИБМ1",
 "Экономика и бизнес"
).
  
кафедра("a2fd0769-82fc-1029-96dd-000347adedc6",
 "ИБМ2",
 "Экономика и организация производства"
).
  
кафедра("a2fffd32-82fc-1029-96dd-000347adedc6",
 "ИБМ3",
 "Промышленная логистика"
).
  
кафедра("a302aea1-82fc-1029-96dd-000347adedc6",
 "ИБМ4",
 "Менеджмент"
).
  
кафедра("a3051d41-82fc-1029-96dd-000347adedc6",
 "ИБМ5",
 "Финансы"
).
  
кафедра("a30801e9-82fc-1029-96dd-000347adedc6",
 "ИБМ6",
 "Предпринимательство и внешнеэкономическая деятельность"
).
  
кафедра("45619792-bdb9-11e0-add3-003048dc3bec",
 "ИБМ7",
 "Инновационное предпринимательство"
).
  
кафедра("a2336d07-82fc-1029-96dd-000347adedc6",
 "ИУ1",
 "Системы автоматического управления"
).

кафедра("ИУ1-КФ",
 "ИУ1-КФ",
 "Проектирование и технология производства электронных приборов"
).
  
кафедра("a2362498-82fc-1029-96dd-000347adedc6",
 "ИУ2",
 "Приборы и системы ориентации, стабилизации и навигации"
).

кафедра("ИУ2-КФ",
 "ИУ2-КФ",
 "Информационные системы и сети"
).

  
кафедра("ИУ3-КФ",
 "ИУ3-КФ",
 "Системы автоматического управления и электротехника"
).

кафедра("a238f38e-82fc-1029-96dd-000347adedc6",
 "ИУ3",
 "Информационные системы и телекоммуникации"
).

кафедра("a23baf8a-82fc-1029-96dd-000347adedc6",
 "ИУ4",
 "Проектирование и технология производства электронной аппаратуры"
).

кафедра("ИУ4-КФ",
 "ИУ4-КФ",
 "Программное обеспечение ЭВМ, информационные технологии"
).

кафедра("a22f8d37-82fc-1029-96dd-000347adedc6",
 "ИУ5",
 "Системы обработки информации и управления"
).

кафедра("ИУ5-КФ",
 "ИУ5-КФ",
 "Системы обработки информации"
).
  
кафедра("ИУ6-КФ",
 "ИУ6-КФ",
 "Защита информации"
).

кафедра("a23f77c7-82fc-1029-96dd-000347adedc6",
 "ИУ6",
 "Компьютерные системы и сети"
).
  
кафедра("ИУ7-КФ",
 "ИУ7-КФ",
 "Экология и промышленная безопасность"
).

кафедра("a242bc7a-82fc-1029-96dd-000347adedc6",
 "ИУ7",
 "Программное обеспечение ЭВМ и информационные технологии"
).
  
кафедра("a245f184-82fc-1029-96dd-000347adedc6",
 "ИУ8",
 "Информационная безопасность"
).
  
кафедра("a24974ff-82fc-1029-96dd-000347adedc6",
 "ИУ9",
 "Теоретическая информатика и компьютерные технологии"
).
  
кафедра("63332b7b-03f8-102a-b397-000cf1a7cbf0",
 "ИУ10",
 "Защита информации"
).
  
кафедра("7aabbe82-7c15-11e2-a98e-005056960017",
 "ИУ11",
 "Космические приборы и системы"
).
  
кафедра("a25ac83e-82fc-1029-96dd-000347adedc6",
 "Л1",
 "Русский язык"
).
  
кафедра("a25c363f-82fc-1029-96dd-000347adedc6",
 "Л2",
 "Английский язык для приборостроительных специальностей"
).
  
кафедра("a25db492-82fc-1029-96dd-000347adedc6",
 "Л3",
 "Английский язык для машиностроительных специальностей"
).
  
кафедра("a25f2c1f-82fc-1029-96dd-000347adedc6",
 "Л4",
 "Романо-германские языки"
).
  
кафедра("a2613a7f-82fc-1029-96dd-000347adedc6",
 "МТ1",
 "Металлорежущие станки"
).
  
кафедра("a263f3cb-82fc-1029-96dd-000347adedc6",
 "МТ2",
 "Инструментальная техника и технологии"
).
  
кафедра("a266c14b-82fc-1029-96dd-000347adedc6",
 "МТ3",
 "Технологии машиностроения"
).
  
кафедра("a26a16f6-82fc-1029-96dd-000347adedc6",
 "МТ4",
 "Метрология и взаимозаменяемость"
).
  
кафедра("a26c7a64-82fc-1029-96dd-000347adedc6",
 "МТ5",
 "Литейные технологии"
).
  
кафедра("a26f5d4c-82fc-1029-96dd-000347adedc6",
 "МТ6",
 "Технологии обработки давлением"
).
  
кафедра("a2722887-82fc-1029-96dd-000347adedc6",
 "МТ7",
 "Технологии сварки и диагностики"
).
  
кафедра("a274d093-82fc-1029-96dd-000347adedc6",
 "МТ8",
 "Материаловедение"
).
  
кафедра("8099e914-2861-11e0-8bca-003048c6b34e",
 "МТ9",
 "Промышленный дизайн"
).
  
кафедра("a2777f66-82fc-1029-96dd-000347adedc6",
 "МТ10",
 "Оборудование и технологии прокатки"
).
  
кафедра("a27a8198-82fc-1029-96dd-000347adedc6",
 "МТ11",
 "Электронные технологии в машиностроении"
).
  
кафедра("a27d351f-82fc-1029-96dd-000347adedc6",
 "МТ12",
 "Лазерные технологии в машиностроении"
).
  
кафедра("a27f86fe-82fc-1029-96dd-000347adedc6",
 "МТ13",
 "Технологии обработки материалов"
).
  
кафедра("a2c47171-82fc-1029-96dd-000347adedc6",
 "РК1",
 "Инженерная графика"
).
  
кафедра("a2c64cff-82fc-1029-96dd-000347adedc6",
 "РК2",
 "Теория механизмов и машин"
).
  
кафедра("a2c839f2-82fc-1029-96dd-000347adedc6",
 "РК3",
 "Основы конструирования машин"
).
  
кафедра("a2c9f870-82fc-1029-96dd-000347adedc6",
 "РК4",
 "Подъемно-транспортные системы"
).
  
кафедра("a2ccf88a-82fc-1029-96dd-000347adedc6",
 "РК5",
 "Прикладная механика"
).
  
кафедра("a2d011ed-82fc-1029-96dd-000347adedc6",
 "РК6",
 "Системы автоматизированного проектирования"
).
  
кафедра("a2d3d661-82fc-1029-96dd-000347adedc6",
 "РК9",
 "Компьютерные системы автоматизации производства"
).
  
кафедра("a2d6bee9-82fc-1029-96dd-000347adedc6",
 "РК10",
 "Робототехнические системы"
).
  
кафедра("a2d99739-82fc-1029-96dd-000347adedc6",
 "РЛ1",
 "Радиоэлектронные системы и устройства"
).
  
кафедра("a2ddd539-82fc-1029-96dd-000347adedc6",
 "РЛ2",
 "Лазерные и оптико-электронные системы"
).
  
кафедра("a2e2a302-82fc-1029-96dd-000347adedc6",
 "РЛ3",
 "Оптико-электронные приборы научных исследований"
).
  
кафедра("a2e4f484-82fc-1029-96dd-000347adedc6",
 "РЛ4",
 "Теоретические основы электротехники"
).
  
кафедра("a2e6d0c5-82fc-1029-96dd-000347adedc6",
 "РЛ5",
 "Элементы приборных устройств"
).
  
кафедра("a2e8905d-82fc-1029-96dd-000347adedc6",
 "РЛ6",
 "Технологии приборостроения"
).
  
кафедра("a2f2f647-82fc-1029-96dd-000347adedc6",
 "СГН1",
 "История"
).
  
кафедра("a2f4b5c0-82fc-1029-96dd-000347adedc6",
 "СГН2",
 "Социология и культурология"
).
  
кафедра("a2f68019-82fc-1029-96dd-000347adedc6",
 "СГН3",
 "Информационная аналитика и политические технологии"
).
  
кафедра("a2f86ea3-82fc-1029-96dd-000347adedc6",
 "СГН4",
 "Философия"
).
  
кафедра("a2820cf5-82fc-1029-96dd-000347adedc6",
 "СМ1",
 "Космические аппараты и ракеты-носители"
).
  
кафедра("a2850cf6-82fc-1029-96dd-000347adedc6",
 "СМ2",
 "Аэрокосмические системы"
).
  
кафедра("a2874418-82fc-1029-96dd-000347adedc6",
 "СМ3",
 "Динамика и управление полетом ракет и космических аппаратов"
).
  
кафедра("a28a287d-82fc-1029-96dd-000347adedc6",
 "СМ4",
 "Высокоточные летательные аппараты"
).
  
кафедра("a28ce088-82fc-1029-96dd-000347adedc6",
 "СМ5",
 "Автономные информационные и управляющие системы"
).
  
кафедра("a28fbe3a-82fc-1029-96dd-000347adedc6",
 "СМ6",
 "Ракетные и импульсные системы"
).
  
кафедра("a2930bad-82fc-1029-96dd-000347adedc6",
 "СМ7",
 "Робототехнические системы и мехатроника"
).
  
кафедра("a2960461-82fc-1029-96dd-000347adedc6",
 "СМ8",
 "Стартовые ракетные комплексы"
).
  
кафедра("a2994a8a-82fc-1029-96dd-000347adedc6",
 "СМ9",
 "Многоцелевые гусеничные машины и мобильные роботы"
).
  
кафедра("a29c25d2-82fc-1029-96dd-000347adedc6",
 "СМ10",
 "Колесные машины"
).
  
кафедра("a29f1184-82fc-1029-96dd-000347adedc6",
 "СМ11",
 "Подводные роботы и аппараты"
).
  
кафедра("a2a1433a-82fc-1029-96dd-000347adedc6",
 "СМ12",
 "Технологии ракетно-космического машиностроения"
).
  
кафедра("a2a38d93-82fc-1029-96dd-000347adedc6",
 "СМ13",
 "Ракетно-космические композитные конструкции"
).
  
кафедра("a24c14a4-82fc-1029-96dd-000347adedc6",
 "ФН1",
 "Высшая математика"
).
  
кафедра("a24db5e0-82fc-1029-96dd-000347adedc6",
 "ФН2",
 "Прикладная математика"
).
  
кафедра("a250b7cf-82fc-1029-96dd-000347adedc6",
 "ФН3",
 "Теоретическая механика"
).
  
кафедра("a252230a-82fc-1029-96dd-000347adedc6",
 "ФН4",
 "Физика"
).
  
кафедра("a254724a-82fc-1029-96dd-000347adedc6",
 "ФН5",
 "Химия"
).
  
кафедра("a255e4be-82fc-1029-96dd-000347adedc6",
 "ФН7",
 "Электротехника и промышленная электроника"
).
  
кафедра("a2576289-82fc-1029-96dd-000347adedc6",
 "ФН11",
 "Вычислительная математика и математическая физика"
).
  
кафедра("a258e401-82fc-1029-96dd-000347adedc6",
 "ФН12",
 "Математическое моделирование"
).
  
кафедра("a2a627da-82fc-1029-96dd-000347adedc6",
 "Э1",
 "Ракетные двигатели"
).
  
кафедра("a2a91624-82fc-1029-96dd-000347adedc6",
 "Э2",
 "Поршневые двигатели"
).
  
кафедра("a2abf2a0-82fc-1029-96dd-000347adedc6",
 "Э3",
 "Газотурбинные и нетрадиционные энергоустановки"
).
  
кафедра("a2af0836-82fc-1029-96dd-000347adedc6",
 "Э4",
 "Холодильная, криогенная техника, системы кондиционирования и жизнеобеспечения"
).
  
кафедра("a2b276a4-82fc-1029-96dd-000347adedc6",
 "Э5",
 "Вакуумная и компрессорная техника"
).
  
кафедра("a2b5707b-82fc-1029-96dd-000347adedc6",
 "Э6",
 "Теплофизика"
).
  
кафедра("a2b7ae88-82fc-1029-96dd-000347adedc6",
 "Э7",
 "Ядерные реакторы и установки"
).
  
кафедра("a2bae368-82fc-1029-96dd-000347adedc6",
 "Э8",
 "Плазменные энергетические установки"
).
  
кафедра("a2bdbf1a-82fc-1029-96dd-000347adedc6",
 "Э9",
 "Экология и промышленная безопасность"
).
  
кафедра("a2c0dadb-82fc-1029-96dd-000347adedc6",
 "Э10",
 "Гидромеханика, гидромашины и гидропневмоавтоматика"
).
  
кафедра("a31915ee-82fc-1029-96dd-000347adedc6",
 "ЮР",
 "Юриспруденция, интеллектуальная собственность и судебная экспертиза.").
