:- dynamic шаг_космонавтика/2.
:- dynamic шаг_центр/2.
:- dynamic шаг_москва/2.
:- dynamic профессор_жуковский/2.
:- dynamic профессор_лебедев/2.

:- dynamic секция_в_направлении/2.
:- dynamic кафедра_в_секции/2.

секция_в_направлении('Космонавтика - Космические аппараты и ракеты-носители','ШБК').
секция_в_направлении('Космонавтика - Аэрокосмические системы','ШБК').
секция_в_направлении('Космонавтика - Аэродинамическое и баллистическое проектирование, управление полетом ракет-носителей и космических систем','ШБК').
секция_в_направлении('Космонавтика - Автономные радиоэлектронные устройства управления, автоматические системы и робототехника','ШБК').
секция_в_направлении('Космонавтика - Автоматизированные системы специального машиностроения, газодинамические устройства в ракетах-носителях и космических аппаратах','ШБК').
секция_в_направлении('Космонавтика - Стартовые комплексы ракетно-комической техники, планетоходы, научные и промышленные базы на Луне и планетах, монтажные работы в космосе','ШБК').
секция_в_направлении('Космонавтика - Технология изготовления, сборки и испытаний ракетно-космической техники','ШБК').
секция_в_направлении('Космонавтика - Ракетно-космические композиционные конструкции','ШБК').
секция_в_направлении('Космонавтика - Двигательные установки ракет-носителей и космических аппаратов','ШБК').
секция_в_направлении('Космонавтика - Системы кондиционирования и жизнеобеспечения','ШБК').
секция_в_направлении('Космонавтика - Системы управления ракетно-космическими объектами и комплексами летательных аппаратов','ШБК').
секция_в_направлении('Космонавтика – Приборы навигации','ШБК').
секция_в_направлении('Россия - Современные радио -, оптические и электронные системы в технике и медицине','ШБР').
секция_в_направлении('Россия - Прикладная механика и компьютерные технологии в автоматизации и робототехнике','ШБР').
секция_в_направлении('Россия - Аэрокосмонавтика','ШБР').
секция_в_направлении('Россия - Транспортные машины, системы и оборудование, колесные машины','ШБР').
секция_в_направлении('Россия - Передовые технологии на транспорте','ШБР').
секция_в_направлении('Россия - Машиностроительные технологии, технологии будущего своими руками','ШБР').
секция_в_направлении('Россия - Энергетические системы будущего','ШБР').
секция_в_направлении('Россия - Альтернативные источники энергии','ШБР').
секция_в_направлении('Россия - Биомедицинская техника','ШБР').
секция_в_направлении('Россия - Интеллектуальные компьютерные системы','ШБР').
секция_в_направлении('Россия - Физика, лазерные и нанотехнологии','ШБР').
секция_в_направлении('Россия - Технологии создания новых материалов','ШБР').
секция_в_направлении('Россия - Прикладная математика','ШБР').
секция_в_направлении('Россия - Математика и компьютерные науки','ШБР').
секция_в_направлении('Россия - Умные машины, интеллектуальные конструкции, робототехника','ШБР').
секция_в_направлении('Россия - Математика и ее приложения в информационных технологиях','ШБР').
секция_в_направлении('Россия - Информационные технологии, автоматизация, энергосбережение, Информатика, вычислительная техника, телекоммуникации','ШБР').
секция_в_направлении('Россия - Искусственный интеллект и принятие решений','ШБР').
секция_в_направлении('Центр - Металлорежущие станки','ШБМ').
секция_в_направлении('Центр - Инструментальная техника и технологии','ШБМ').
секция_в_направлении('Центр - Технология машиностроения','ШБМ').
секция_в_направлении('Центр - Метрология и взаимозаменяемость','ШБМ').
секция_в_направлении('Центр - Литейные технологии','ШБМ').
секция_в_направлении('Центр - Технологии обработки давлением','ШБМ').
секция_в_направлении('Центр - Технологии сварки и диагностики','ШБМ').
секция_в_направлении('Центр - Материаловедение','ШБМ').
секция_в_направлении('Центр - Промышленный дизайн','ШБМ').
секция_в_направлении('Центр - Оборудование и технологии прокатки','ШБМ').
секция_в_направлении('Центр - Электронные технологии','ШБМ').
секция_в_направлении('Центр - Лазерные технологии в машиностроении','ШБМ').
секция_в_направлении('Центр - Технологии обработки материалов','ШБМ').
секция_в_направлении('Центр - Интеллектуальные системы управления','ШБМ').
секция_в_направлении('Центр - Приборы и системы ориентации, стабилизации и навигации','ШБМ').
секция_в_направлении('Центр - Информационные системы и телекоммуникации','ШБМ').
секция_в_направлении('Центр - Наукоемкие технологии в проектировании и производстве электронно-вычислительных и телекоммуникационных систем','ШБМ').
секция_в_направлении('Центр - Системы обработки информации и управления','ШБМ').
секция_в_направлении('Центр - Компьютерные системы','ШБМ').
секция_в_направлении('Центр - Выставка-конкурс программных разработок','ШБМ').
секция_в_направлении('Центр - Информационная безопасность','ШБМ').
секция_в_направлении('Центр - Оптико-электронные приборы и системы','ШБМ').
секция_в_направлении('Центр - Радиоэлектроника','ШБМ').
секция_в_направлении('Центр - Биомедицинские технические системы','ШБМ').
секция_в_направлении('Центр - Медико-технические информационные технологии','ШБМ').
секция_в_направлении('Центр - Машиностроение','ШБМ').
секция_в_направлении('Центр - Импульсные технологии в машиностроении','ШБМ').
секция_в_направлении('Центр - Специальная робототехника и мехатроника','ШБМ').
секция_в_направлении('Центр - Поршневые двигатели','ШБМ').
секция_в_направлении('Центр - Газотурбинные и нетрадиционные энергоустановки','ШБМ').
секция_в_направлении('Центр - Холодильная и криогенная техника систем кондиционирования и жизнеобеспечения','ШБМ').
секция_в_направлении('Центр - Вакуумная и компрессорная техника','ШБМ').
секция_в_направлении('Центр - Теплофизика','ШБМ').
секция_в_направлении('Центр - Ядерные реакторы и установки','ШБМ').
секция_в_направлении('Центр - Плазменные и энергетические установки','ШБМ').
секция_в_направлении('Центр - Промышленная экология','ШБМ').
секция_в_направлении('Центр - Гидромеханика, гидромашины и гидропневмоавтоматика','ШБМ').
секция_в_направлении('Центр - Подъемно-транспортные системы. Конструкторское направление','ШБМ').
секция_в_направлении('Центр - Прикладная механика','ШБМ').
секция_в_направлении('Центр - Системы автоматизированного проектирования','ШБМ').
секция_в_направлении('Центр - Компьютерные системы автоматизированного производства','ШБМ').
секция_в_направлении('Центр - Экономика и организация производства','ШБМ').
секция_в_направлении('Центр - Промышленная логистика','ШБМ').
секция_в_направлении('Центр - Менеджмент','ШБМ').
секция_в_направлении('Центр - Финансы','ШБМ').
секция_в_направлении('Центр - Предпринимательство и внешнеэкономическая деятельность','ШБМ').
секция_в_направлении('Центр - Инновационное предпринимательство','ШБМ').
секция_в_направлении('Центр - Физика и познание мира','ШБМ').
секция_в_направлении('Центр - Прикладная математика','ШБМ').
секция_в_направлении('Физика','Профессор Жуковский').
секция_в_направлении('Металлорежущие станки','Профессор Жуковский').
секция_в_направлении('Инструментальная техника и технологии','Профессор Жуковский').
секция_в_направлении('Технологии машиностроения','Профессор Жуковский').
секция_в_направлении('Метрология и взаимозаменяемость','Профессор Жуковский').
секция_в_направлении('Литейные технологии','Профессор Жуковский').
секция_в_направлении('Технологии обработки давлением','Профессор Жуковский').
секция_в_направлении('Технологии сварки и диагностики','Профессор Жуковский').
секция_в_направлении('Материаловедение','Профессор Жуковский').
секция_в_направлении('Промышленный дизайн','Профессор Жуковский').
секция_в_направлении('Оборудование и технологии прокатки','Профессор Жуковский').
секция_в_направлении('Электронные технологии в машиностроении','Профессор Жуковский').
секция_в_направлении('Лазерные технологии в машиностроении','Профессор Жуковский').
секция_в_направлении('Технологии обработки материалов','Профессор Жуковский').
секция_в_направлении('Ракетные двигатели','Профессор Жуковский').
секция_в_направлении('Поршневые двигатели','Профессор Жуковский').
секция_в_направлении('Газотурбинные и нетрадиционные энергоустановки','Профессор Жуковский').
секция_в_направлении('Холодильная, криогенная техника системы кондиционирования и жизнеобеспечения','Профессор Жуковский').
секция_в_направлении('Вакуумная и компрессорная техника','Профессор Жуковский').
секция_в_направлении('Теплофизика','Профессор Жуковский').
секция_в_направлении('Ядерные реакторы и установки','Профессор Жуковский').
секция_в_направлении('Плазменные энергетические установки','Профессор Жуковский').
секция_в_направлении('Экология и промышленная безопасность','Профессор Жуковский').
секция_в_направлении('Гидромеханика, гидромашины и гидропневмоавтоматика','Профессор Жуковский').
секция_в_направлении('Космические аппараты и ракеты-носители','Профессор Жуковский').
секция_в_направлении('Аэрокосмические системы','Профессор Жуковский').
секция_в_направлении('Динамика и управление полетом ракет и космических аппаратов','Профессор Жуковский').
секция_в_направлении('Высокоточные летательные аппараты','Профессор Жуковский').
секция_в_направлении('Автономные информационные и управляющие системы','Профессор Жуковский').
секция_в_направлении('Ракетные и импульсные системы','Профессор Жуковский').
секция_в_направлении('Специальная робототехника и мехатроника','Профессор Жуковский').
секция_в_направлении('Стартовые ракетные комплексы','Профессор Жуковский').
секция_в_направлении('Многоцелевые гусеничные машины и мобильные роботы','Профессор Жуковский').
секция_в_направлении('Колесные машины','Профессор Жуковский').
секция_в_направлении('Подводные роботы и аппараты','Профессор Жуковский').
секция_в_направлении('Технологии ракетно-космического машиностроения','Профессор Жуковский').
секция_в_направлении('Ракетно-космические композиционные конструкции','Профессор Жуковский').
секция_в_направлении('Подъемно-транспортные системы','Профессор Жуковский').
секция_в_направлении('Прикладная механика','Профессор Жуковский').
секция_в_направлении('Системы автоматизированного проектирования','Профессор Жуковский').
секция_в_направлении('Компьютерные системы автоматизации производства','Профессор Жуковский').
секция_в_направлении('Радиоэлектронные системы и устройства','Профессор Жуковский').
секция_в_направлении('Лазерные и оптико-электронные системы','Профессор Жуковский').
секция_в_направлении('Элементы приборных устройств','Профессор Жуковский').
секция_в_направлении('Технологии приборостроения','Профессор Жуковский').
секция_в_направлении('Системы автоматического управления','Профессор Жуковский').
секция_в_направлении('Приборы и системы ориентации, стабилизации и навигации','Профессор Жуковский').
секция_в_направлении('Конструирование и производство электронной аппаратуры','Профессор Жуковский').
секция_в_направлении('Информационная безопасность','Профессор Жуковский').
секция_в_направлении('Биомедицинские технические системы','Профессор Жуковский').
секция_в_направлении('Медико-технические информационные технологии','Профессор Жуковский').
секция_в_направлении('Медико-технический менеджмент','Профессор Жуковский').
секция_в_направлении('Экономика и организация производства','Профессор Жуковский').
секция_в_направлении('Промышленная логистика','Профессор Жуковский').
секция_в_направлении('Менеджмент','Профессор Жуковский').
секция_в_направлении('Финансы','Профессор Жуковский').
секция_в_направлении('Предпринимательство и внешнеэкономическая деятельность','Профессор Жуковский').
секция_в_направлении('Инновационное предпринимательство','Профессор Жуковский').
секция_в_направлении('Информационные системы и телекоммуникации','Профессор Лебедев').
секция_в_направлении('Системы обработки информации и управления','Профессор Лебедев').
секция_в_направлении('Компьютерные системы и сети','Профессор Лебедев').
секция_в_направлении('Программное обеспечение ЭВМ и информационные технологии','Профессор Лебедев').
секция_в_направлении('Теоретическая информатика и компьютерные технологии','Профессор Лебедев').
секция_в_направлении('Системы автоматизированного проектирования','Профессор Лебедев').

кафедра_в_секции('СМ-1','Космонавтика - Космические аппараты и ракеты-носители').
кафедра_в_секции('СМ-2','Космонавтика - Аэрокосмические системы').
кафедра_в_секции('СМ-3','Космонавтика - Аэродинамическое и баллистическое проектирование, управление полетом ракет-носителей и космических систем').
кафедра_в_секции('СМ-5','Космонавтика - Автономные радиоэлектронные устройства управления, автоматические системы и робототехника').
кафедра_в_секции('СМ-7','Космонавтика - Автономные радиоэлектронные устройства управления, автоматические системы и робототехника').
кафедра_в_секции('СМ-11','Космонавтика - Автономные радиоэлектронные устройства управления, автоматические системы и робототехника').
кафедра_в_секции('СМ-4','Космонавтика - Автоматизированные системы специального машиностроения, газодинамические устройства в ракетах-носителях и космических аппаратах').
кафедра_в_секции('СМ-6','Космонавтика - Автоматизированные системы специального машиностроения, газодинамические устройства в ракетах-носителях и космических аппаратах').
кафедра_в_секции('СМ-8','Космонавтика - Стартовые комплексы ракетно-комической техники, планетоходы, научные и промышленные базы на Луне и планетах, монтажные работы в космосе').
кафедра_в_секции('СМ-9','Космонавтика - Стартовые комплексы ракетно-комической техники, планетоходы, научные и промышленные базы на Луне и планетах, монтажные работы в космосе').
кафедра_в_секции('СМ-10','Космонавтика - Стартовые комплексы ракетно-комической техники, планетоходы, научные и промышленные базы на Луне и планетах, монтажные работы в космосе').
кафедра_в_секции('СМ-12','Космонавтика - Технология изготовления, сборки и испытаний ракетно-космической техники').
кафедра_в_секции('СМ-13','Космонавтика - Ракетно-космические композиционные конструкции').
кафедра_в_секции('Э-1','Космонавтика - Двигательные установки ракет-носителей и космических аппаратов').
кафедра_в_секции('Э-4','Космонавтика - Системы кондиционирования и жизнеобеспечения').
кафедра_в_секции('ИУ-1','Космонавтика - Системы управления ракетно-космическими объектами и комплексами летательных аппаратов').
кафедра_в_секции('ИУ-2','Космонавтика – Приборы навигации').
кафедра_в_секции('РЛ-1','Россия - Современные радио -, оптические и электронные системы в технике и медицине').
кафедра_в_секции('РЛ-2','Россия - Современные радио -, оптические и электронные системы в технике и медицине').
кафедра_в_секции('РЛ-6','Россия - Современные радио -, оптические и электронные системы в технике и медицине').
кафедра_в_секции('РК-4','Россия - Прикладная механика и компьютерные технологии в автоматизации и робототехнике').
кафедра_в_секции('РК-5','Россия - Прикладная механика и компьютерные технологии в автоматизации и робототехнике').
кафедра_в_секции('СМ-1','Россия - Аэрокосмонавтика').
кафедра_в_секции('СМ-2','Россия - Аэрокосмонавтика').
кафедра_в_секции('СМ-8','Россия - Аэрокосмонавтика').
кафедра_в_секции('СМ-9','Россия - Транспортные машины, системы и оборудование, колесные машины').
кафедра_в_секции('СМ-10','Россия - Транспортные машины, системы и оборудование, колесные машины').
кафедра_в_секции('РК-4','Россия - Передовые технологии на транспорте').
кафедра_в_секции('РК-7','Россия - Передовые технологии на транспорте').
кафедра_в_секции('РК-9','Россия - Передовые технологии на транспорте').
кафедра_в_секции('МТ-2','Россия - Машиностроительные технологии, технологии будущего своими руками').
кафедра_в_секции('Э-5','Россия - Энергетические системы будущего').
кафедра_в_секции('Э-2','Россия - Альтернативные источники энергии').
кафедра_в_секции('БМТ-1','Россия - Биомедицинская техника').
кафедра_в_секции('РК-6','Россия - Интеллектуальные компьютерные системы').
кафедра_в_секции('ФН-4','Россия - Физика, лазерные и нанотехнологии').
кафедра_в_секции('МТ-8','Россия - Технологии создания новых материалов').
кафедра_в_секции('ФН-2','Россия - Прикладная математика').
кафедра_в_секции('ФН-11','Россия - Математика и компьютерные науки').
кафедра_в_секции('РК-5','Россия - Умные машины, интеллектуальные конструкции, робототехника').
кафедра_в_секции('ФН-2','Россия - Математика и ее приложения в информационных технологиях').
кафедра_в_секции('ФН-12','Россия - Математика и ее приложения в информационных технологиях').
кафедра_в_секции('ИУ-3','Россия - Информационные технологии, автоматизация, энергосбережение, Информатика, вычислительная техника, телекоммуникации').
кафедра_в_секции('ИУ-7','Россия - Информационные технологии, автоматизация, энергосбережение, Информатика, вычислительная техника, телекоммуникации').
кафедра_в_секции('ИУ-5','Россия - Искусственный интеллект и принятие решений').
кафедра_в_секции('ИУ-6','Россия - Искусственный интеллект и принятие решений').
кафедра_в_секции('ИУ-8','Центр - Информационная безопасность').
кафедра_в_секции('РЛ-2','Центр - Оптико-электронные приборы и системы').
кафедра_в_секции('РЛ-1','Центр - Радиоэлектроника').
кафедра_в_секции('РЛ-6','Центр - Радиоэлектроника').
кафедра_в_секции('БМТ-1','Центр - Биомедицинские технические системы').
кафедра_в_секции('БМТ-2','Центр - Медико-технические информационные технологии').
кафедра_в_секции('СМ-6','Центр - Машиностроение').
кафедра_в_секции('СМ-9','Центр - Машиностроение').
кафедра_в_секции('СМ-10','Центр - Машиностроение').
кафедра_в_секции('СМ-4','Центр - Импульсные технологии в машиностроении').
кафедра_в_секции('СМ-7','Центр - Специальная робототехника и мехатроника').
кафедра_в_секции('Э-2','Центр - Поршневые двигатели').
кафедра_в_секции('Э-3','Центр - Газотурбинные и нетрадиционные энергоустановки').
кафедра_в_секции('Э-4','Центр - Холодильная и криогенная техника систем кондиционирования и жизнеобеспечения').
кафедра_в_секции('Э-5','Центр - Вакуумная и компрессорная техника').
кафедра_в_секции('Э-6','Центр - Теплофизика').
кафедра_в_секции('Э-7','Центр - Ядерные реакторы и установки').
кафедра_в_секции('Э-8','Центр - Плазменные и энергетические установки').
кафедра_в_секции('Э-9','Центр - Промышленная экология').
кафедра_в_секции('Э-10','Центр - Гидромеханика, гидромашины и гидропневмоавтоматика').
кафедра_в_секции('РК-4','Центр - Подъемно-транспортные системы. Конструкторское направление').
кафедра_в_секции('РК-5','Центр - Прикладная механика').
кафедра_в_секции('РК-6','Центр - Системы автоматизированного проектирования').
кафедра_в_секции('РК-9','Центр - Компьютерные системы автоматизированного производства').
кафедра_в_секции('ИБМ-2','Центр - Экономика и организация производства').
кафедра_в_секции('ИБМ-3','Центр - Промышленная логистика').
кафедра_в_секции('ИБМ-4','Центр - Менеджмент').
кафедра_в_секции('ИБМ-5','Центр - Финансы').
кафедра_в_секции('ИБМ-6','Центр - Предпринимательство и внешнеэкономическая деятельность').
кафедра_в_секции('ИБМ-7','Центр - Инновационное предпринимательство').
кафедра_в_секции('ФН-4','Центр - Физика и познание мира').
кафедра_в_секции('ФН-2','Центр - Прикладная математика').
кафедра_в_секции('МТ-11','Центр - Электронные технологии').
кафедра_в_секции('МТ-12','Центр - Лазерные технологии в машиностроении').
кафедра_в_секции('МТ-13','Центр - Технологии обработки материалов').
кафедра_в_секции('ИУ-1','Центр - Интеллектуальные системы управления').
кафедра_в_секции('ИУ-2','Центр - Приборы и системы ориентации, стабилизации и навигации').
кафедра_в_секции('ИУ-3','Центр - Информационные системы и телекоммуникации').
кафедра_в_секции('ИУ-4','Центр - Наукоемкие технологии в проектировании и производстве электронно-вычислительных и телекоммуникационных систем').
кафедра_в_секции('ИУ-5','Центр - Системы обработки информации и управления').
кафедра_в_секции('ИУ-6','Центр - Компьютерные системы').
кафедра_в_секции('ИУ-7','Центр - Выставка-конкурс программных разработок').
кафедра_в_секции('МТ-1','Центр - Металлорежущие станки').
кафедра_в_секции('МТ-2','Центр - Инструментальная техника и технологии').
кафедра_в_секции('МТ-3','Центр - Технология машиностроения').
кафедра_в_секции('МТ-4','Центр - Метрология и взаимозаменяемость').
кафедра_в_секции('МТ-5','Центр - Литейные технологии').
кафедра_в_секции('МТ-6','Центр - Технологии обработки давлением').
кафедра_в_секции('МТ-7','Центр - Технологии сварки и диагностики').
кафедра_в_секции('МТ-8','Центр - Материаловедение').
кафедра_в_секции('МТ-9','Центр - Промышленный дизайн').
кафедра_в_секции('МТ-10','Центр - Оборудование и технологии прокатки').
кафедра_в_секции('ФН-4','Физика').
кафедра_в_секции('МТ-1','Металлорежущие станки').
кафедра_в_секции('МТ-2','Инструментальная техника и технологии').
кафедра_в_секции('МТ-3','Технологии машиностроения').
кафедра_в_секции('МТ-4','Метрология и взаимозаменяемость').
кафедра_в_секции('МТ-5','Литейные технологии').
кафедра_в_секции('МТ-6','Технологии обработки давлением').
кафедра_в_секции('МТ-7','Технологии сварки и диагностики').
кафедра_в_секции('МТ-8','Материаловедение').
кафедра_в_секции('МТ-9','Промышленный дизайн').
кафедра_в_секции('МТ-10','Оборудование и технологии прокатки').
кафедра_в_секции('МТ-11','Электронные технологии в машиностроении').
кафедра_в_секции('МТ-12','Лазерные технологии в машиностроении').
кафедра_в_секции('МТ-13','Технологии обработки материалов').
кафедра_в_секции('Э-1','Ракетные двигатели').
кафедра_в_секции('Э-2','Поршневые двигатели').
кафедра_в_секции('Э-3','Газотурбинные и нетрадиционные энергоустановки').
кафедра_в_секции('Э-4','Холодильная, криогенная техника системы кондиционирования и жизнеобеспечения').
кафедра_в_секции('Э-5','Вакуумная и компрессорная техника').
кафедра_в_секции('Э-6','Теплофизика').
кафедра_в_секции('Э-7','Ядерные реакторы и установки').
кафедра_в_секции('Э-8','Плазменные энергетические установки').
кафедра_в_секции('Э-9','Экология и промышленная безопасность').
кафедра_в_секции('Э-10','Гидромеханика, гидромашины и гидропневмоавтоматика').
кафедра_в_секции('СМ-1','Космические аппараты и ракеты-носители').
кафедра_в_секции('СМ-2','Аэрокосмические системы').
кафедра_в_секции('СМ-3','Динамика и управление полетом ракет и космических аппаратов').
кафедра_в_секции('СМ-4','Высокоточные летательные аппараты').
кафедра_в_секции('Э-5','Вакуумная и компрессорная техника').
кафедра_в_секции('Э-6','Теплофизика').
кафедра_в_секции('Э-7','Ядерные реакторы и установки').
кафедра_в_секции('Э-8','Плазменные энергетические установки').
кафедра_в_секции('Э-9','Экология и промышленная безопасность').
кафедра_в_секции('Э-10','Гидромеханика, гидромашины и гидропневмоавтоматика').
кафедра_в_секции('СМ-1','Космические аппараты и ракеты-носители').
кафедра_в_секции('СМ-2','Аэрокосмические системы').
кафедра_в_секции('СМ-3','Динамика и управление полетом ракет и космических аппаратов').
кафедра_в_секции('СМ-4','Высокоточные летательные аппараты').
кафедра_в_секции('РК-4','Подъемно-транспортные системы').
кафедра_в_секции('РК-5','Прикладная механика').
кафедра_в_секции('РК-6','Системы автоматизированного проектирования').
кафедра_в_секции('РК-9','Компьютерные системы автоматизации производства').
кафедра_в_секции('РЛ-1','Радиоэлектронные системы и устройства').
кафедра_в_секции('РЛ-2','Лазерные и оптико-электронные системы').
кафедра_в_секции('РЛ-5','Элементы приборных устройств').
кафедра_в_секции('РЛ-6','Технологии приборостроения').
кафедра_в_секции('ИУ-1','Системы автоматического управления').
кафедра_в_секции('ИУ-2','Приборы и системы ориентации, стабилизации и навигации').
кафедра_в_секции('ИУ-4','Конструирование и производство электронной аппаратуры').
кафедра_в_секции('ИУ-8','Информационная безопасность').
кафедра_в_секции('БМТ-1','Биомедицинские технические системы').
кафедра_в_секции('БМТ-2','Медико-технические информационные технологии').
кафедра_в_секции('БМТ-4','Медико-технический менеджмент').
кафедра_в_секции('ИБМ-2','Экономика и организация производства').
кафедра_в_секции('ИБМ-3','Промышленная логистика').
кафедра_в_секции('ИБМ-4','Менеджмент').
кафедра_в_секции('ИБМ-5','Финансы').
кафедра_в_секции('ИБМ-6','Предпринимательство и внешнеэкономическая деятельность').
кафедра_в_секции('ИБМ-7','Инновационное предпринимательство').
кафедра_в_секции('ИУ-3','Информационные системы и телекоммуникации').
кафедра_в_секции('ИУ-5','Системы обработки информации и управления').
кафедра_в_секции('ИУ-6','Компьютерные системы и сети').
кафедра_в_секции('ИУ-7','Программное обеспечение ЭВМ и информационные технологии').
кафедра_в_секции('ИУ-9','Теоретическая информатика и компьютерные технологии').
кафедра_в_секции('РК-6','Системы автоматизированного проектирования').
%%%

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

шаг_космонавтика('Космонавтика - Космические аппараты и ракеты-носители', ['СМ-1']).
шаг_космонавтика('Космонавтика - Аэрокосмические системы', ['СМ-2']).
шаг_космонавтика('Космонавтика - Аэродинамическое и баллистическое проектирование, управление полетом ракет-носителей и космических систем',['СМ-3']).
шаг_космонавтика('Космонавтика - Автономные радиоэлектронные устройства управления, автоматические системы и робототехника',['СМ-5', 'СМ-7', 'СМ-11']).
шаг_космонавтика('Космонавтика - Автоматизированные системы специального машиностроения, газодинамические устройства в ракетах-носителях и космических аппаратах',['СМ-4', 'СМ-6']).
шаг_космонавтика('Космонавтика - Стартовые комплексы ракетно-комической техники, планетоходы, научные и промышленные базы на Луне и планетах, монтажные работы в космосе',['СМ-8', 'СМ-9', 'СМ-10']).
шаг_космонавтика('Космонавтика - Технология изготовления, сборки и испытаний ракетно-космической техники',['СМ-12']).
шаг_космонавтика('Космонавтика - Ракетно-космические композиционные конструкции',['СМ-13']).
шаг_космонавтика('Космонавтика - Двигательные установки ракет-носителей и космических аппаратов',['Э-1']).
шаг_космонавтика('Космонавтика - Системы кондиционирования и жизнеобеспечения',['Э-4']).
шаг_космонавтика('Космонавтика - Системы управления ракетно-космическими объектами и комплексами летательных аппаратов',['ИУ-1']).
шаг_космонавтика('Космонавтика – Приборы навигации',['ИУ-2']).

шаг_центр('Россия - Современные радио -, оптические и электронные системы в технике и медицине',['РЛ-1', 'РЛ-2', 'РЛ-6']).
шаг_центр('Россия - Прикладная механика и компьютерные технологии в автоматизации и робототехнике',['РК-4', 'РК-5']).
шаг_центр('Россия - Аэрокосмонавтика',['СМ-1', 'СМ-2', 'СМ-8']).
шаг_центр('Россия - Транспортные машины, системы и оборудование, колесные машины',['СМ-9', 'СМ-10']).
шаг_центр('Россия - Передовые технологии на транспорте',['РК-4', 'СМ-7', 'СМ-9']).
шаг_центр('Россия - Машиностроительные технологии, технологии будущего своими руками',['МТ-2']).
шаг_центр('Россия - Энергетические системы будущего',['Э-5']).
шаг_центр('Россия - Альтернативные источники энергии',['Э-2']).
шаг_центр('Россия - Биомедицинская техника',['БМТ-1']).
шаг_центр('Россия - Интеллектуальные компьютерные системы',['РК-6']).
шаг_центр('Россия - Физика, лазерные и нанотехнологии',['ФН-4']).
шаг_центр('Россия - Технологии создания новых материалов',['МТ-8']).
шаг_центр('Россия - Прикладная математика',['ФН-2']).
шаг_центр('Россия - Математика и компьютерные науки',['ФН-11']).
шаг_центр('Россия - Умные машины, интеллектуальные конструкции, робототехника',['РК-5']).
шаг_центр('Россия - Математика и ее приложения в информационных технологиях',['ФН-2', 'ФН-12']).
шаг_центр('Россия - Информационные технологии, автоматизация, энергосбережение, Информатика, вычислительная техника, телекоммуникации',['ИУ-3', 'ИУ-7']).
шаг_центр('Россия - Искусственный интеллект и принятие решений',['ИУ-5', 'ИУ-6']).

шаг_москва('Центр - Металлорежущие станки',['МТ-1']).
шаг_москва('Центр - Инструментальная техника и технологии',['МТ-2']).
шаг_москва('Центр - Технология машиностроения',['МТ-3']).
шаг_москва('Центр - Метрология и взаимозаменяемость',['МТ-4']).
шаг_москва('Центр - Литейные технологии',['МТ-5']).
шаг_москва('Центр - Технологии обработки давлением',['МТ-6']).
шаг_москва('Центр - Технологии сварки и диагностики',['МТ-7']).
шаг_москва('Центр - Материаловедение',['МТ-8']).
шаг_москва('Центр - Промышленный дизайн',['МТ-9']).
шаг_москва('Центр - Оборудование и технологии прокатки',['МТ-10']).
шаг_москва('Центр - Электронные технологии',['МТ-11']).
шаг_москва('Центр - Лазерные технологии в машиностроении',['МТ-12']).
шаг_москва('Центр - Технологии обработки материалов',['МТ-13']).
шаг_москва('Центр - Интеллектуальные системы управления',['ИУ-1']).
шаг_москва('Центр - Приборы и системы ориентации, стабилизации и навигации',['ИУ-2']).
шаг_москва('Центр - Информационные системы и телекоммуникации',['ИУ-3']).
шаг_москва('Центр - Наукоемкие технологии в проектировании и производстве электронно-вычислительных и телекоммуникационных систем',['ИУ-4']).
шаг_москва('Центр - Системы обработки информации и управления',['ИУ-5']).
шаг_москва('Центр - Компьютерные системы',['ИУ-6']).
шаг_москва('Центр - Выставка-конкурс программных разработок',['ИУ-7']).
шаг_москва('Центр - Информационная безопасность',['ИУ-8']).
шаг_москва('Центр - Оптико-электронные приборы и системы',['РЛ-2']).
шаг_москва('Центр - Радиоэлектроника',['РЛ-1', 'РЛ-6']).
шаг_москва('Центр - Биомедицинские технические системы',['БМТ-1']).
шаг_москва('Центр - Медико-технические информационные технологии',['БМТ-2']).
шаг_москва('Центр - Машиностроение',['СМ-6', 'СМ-9', 'СМ-10']).
шаг_москва('Центр - Импульсные технологии в машиностроении',['СМ-4']).
шаг_москва('Центр - Специальная робототехника и мехатроника',['СМ-7']).
шаг_москва('Центр - Поршневые двигатели',['Э-2']).
шаг_москва('Центр - Газотурбинные и нетрадиционные энергоустановки',['Э-3']).
шаг_москва('Центр - Холодильная и криогенная техника систем кондиционирования и жизнеобеспечения',['Э-4']).
шаг_москва('Центр - Вакуумная и компрессорная техника',['Э-5']).
шаг_москва('Центр - Теплофизика',['Э-6']).
шаг_москва('Центр - Ядерные реакторы и установки',['Э-7']).
шаг_москва('Центр - Плазменные и энергетические установки',['Э-8']).
шаг_москва('Центр - Промышленная экология',['Э-9']).
шаг_москва('Центр - Гидромеханика, гидромашины и гидропневмоавтоматика',['Э-10']).
шаг_москва('Центр - Подъемно-транспортные системы. Конструкторское направление',['РК-4']).
шаг_москва('Центр - Прикладная механика',['РК-5']).
шаг_москва('Центр - Системы автоматизированного проектирования',['РК-6']).
шаг_москва('Центр - Компьютерные системы автоматизированного производства',['РК-9']).
шаг_москва('Центр - Экономика и организация производства',['ИБМ-2']).
шаг_москва('Центр - Промышленная логистика',['ИБМ-3']).
шаг_москва('Центр - Менеджмент',['ИБМ-4']).
шаг_москва('Центр - Финансы',['ИБМ-5']).
шаг_москва('Центр - Предпринимательство и внешнеэкономическая деятельность',['ИБМ-6']).
шаг_москва('Центр - Инновационное предпринимательство',['ИБМ-7']).
шаг_москва('Центр - Физика и познание мира',['ФН-4']).
шаг_москва('Центр - Прикладная математика',['ФН-2']).

профессор_жуковский('Физика',['ФH4']).
профессор_жуковский('Металлорежущие станки',['МТ1']).
профессор_жуковский('Инструментальная техника и технологии',['МТ2']).
профессор_жуковский('Технологии машиностроения',['МТ3']).
профессор_жуковский('Метрология и взаимозаменяемость',['МТ4']).
профессор_жуковский('Литейные технологии',['МТ5']).
профессор_жуковский('Технологии обработки давлением',['МТ6']).
профессор_жуковский('Технологии сварки и диагностики',['МТ7']).
профессор_жуковский('Материаловедение',['МТ8']).
профессор_жуковский('Промышленный дизайн',['МТ9']).
профессор_жуковский('Оборудование и технологии прокатки',['МТ10']).
профессор_жуковский('Электронные технологии в машиностроении',['МТ11']).
профессор_жуковский('Лазерные технологии в машиностроении',['МТ12']).
профессор_жуковский('Технологии обработки материалов',['МТ13']).
профессор_жуковский('Ракетные двигатели',['Э1']).
профессор_жуковский('Поршневые двигатели',['Э2']).
профессор_жуковский('Газотурбинные и нетрадиционные энергоустановки',['Э3']).
профессор_жуковский('Холодильная, криогенная техника системы кондиционирования и жизнеобеспечения',['Э4']).
профессор_жуковский('Вакуумная и компрессорная техника',['Э5']).
профессор_жуковский('Теплофизика',['Э6']).
профессор_жуковский('Ядерные реакторы и установки',['Э7']).
профессор_жуковский('Плазменные энергетические установки',['Э8']).
профессор_жуковский('Экология и промышленная безопасность',['Э9']).
профессор_жуковский('Гидромеханика, гидромашины и гидропневмоавтоматика',['Э10']).
профессор_жуковский('Космические аппараты и ракеты-носители',['СМ1']).
профессор_жуковский('Аэрокосмические системы',['CМ2']).
профессор_жуковский('Динамика и управление полетом ракет и космических аппаратов',['CМ3']).
профессор_жуковский('Высокоточные летательные аппараты',['CМ4']).
профессор_жуковский('Автономные информационные и управляющие системы',['CМ5']).
профессор_жуковский('Ракетные и импульсные системы',['CМ6']).
профессор_жуковский('Специальная робототехника и мехатроника',['CМ7']).
профессор_жуковский('Стартовые ракетные комплексы',['СМ8']).
профессор_жуковский('Многоцелевые гусеничные машины и мобильные роботы',['CМ9']).
профессор_жуковский('Колесные машины',['CМ10']).
профессор_жуковский('Подводные роботы и аппараты',['CМ11']).
профессор_жуковский('Технологии ракетно-космического машиностроения',['CМ12']).
профессор_жуковский('Ракетно-космические композиционные конструкции',['CМ13']).
профессор_жуковский('Подъемно-транспортные системы',['РК4']).
профессор_жуковский('Прикладная механика',['РК5']).
профессор_жуковский('Системы автоматизированного проектирования',['РК6']).
профессор_жуковский('Компьютерные системы автоматизации производства',['РК9']).
профессор_жуковский('Радиоэлектронные системы и устройства',['РЛ1']).
профессор_жуковский('Лазерные и оптико-электронные системы',['РЛ2']).
профессор_жуковский('Элементы приборных устройств',['РЛ5']).
профессор_жуковский('Технологии приборостроения',['РЛ6']).
профессор_жуковский('Системы автоматического управления',['ИУ1']).
профессор_жуковский('Приборы и системы ориентации, стабилизации и навигации',['ИУ2']).
профессор_жуковский('Конструирование и производство электронной аппаратуры',['ИУ4']).
профессор_жуковский('Информационная безопасность',['ИУ8']).
профессор_жуковский('Биомедицинские технические системы',['БМТ1']).
профессор_жуковский('Медико-технические информационные технологии',['БМТ2']).
профессор_жуковский('Медико-технический менеджмент',['БМТ4']).
профессор_жуковский('Экономика и организация производства',['ИБМ2']).
профессор_жуковский('Промышленная логистика',['ИБМ3']).
профессор_жуковский('Менеджмент',['ИБМ4']).
профессор_жуковский('Финансы',['ИБМ5']).
профессор_жуковский('Предпринимательство и внешнеэкономическая деятельность',['ИБМ6']).
профессор_жуковский('Инновационное предпринимательство',['ИБМ7']). 


профессор_лебедев('Информационные системы и телекоммуникации',['ИУ3']).
профессор_лебедев('Системы обработки информации и управления',['ИУ5']).
профессор_лебедев('Компьютерные системы и сети',['ИУ6']).
профессор_лебедев('Программное обеспечение ЭВМ и информационные технологии',['ИУ7']).
профессор_лебедев('Теоретическая информатика и компьютерные технологии',['ИУ9']).
профессор_лебедев('Системы автоматизированного проектирования',['РК6']).


