секция("Информационные технологии, автоматизация, энергосбережение",["ИУ3", "ИУ7"]).
секция("Информатика, вычислительная техника, телекоммуникации",["ИУ3", "ИУ7"]).
секция("Искусственный интеллект и принятие решений",["ИУ5", "ИУ6"]).

секция("Информационные системы и телекоммуникации",["ИУ3"]).
секция("Системы обработки информации и управления",["ИУ5"]).
секция("Компьютерные системы",["ИУ6"]).
секция("Выставка-конкурс программных разработок",["ИУ7"]).

секция("Космические аппараты и ракеты-носители",["СМ1"]).
секция("Аэрокосмические системы",["СМ2"]).
секция("Аэродинамическое и баллистическое проектирование, управление полетом ракет-носителей и космических систем",["СМ3"]).
секция("Автономные радиоэлектронные устройства управления, автоматические системы и робототехника",["СМ5","СМ7","СМ11"]).
секция("Автоматизированные системы специального машиностроения, газодинамические устройства в ракетах-носителях и космических аппаратах",["СМ4","СМ6"]).
секция("Стартовые комплексы ракетно-комической техники, планетоходы, научные и промышленные базы на Луне и планетах, монтажные работы в космосе",["СМ8","СМ9","СМ10"]).
секция("Технология изготовления, сборки и испытаний ракетно-космической техники",["СМ12"]).
секция("Ракетно-космические композиционные конструкции",["СМ13"]).
секция("Двигательные установки ракет-носителей и космических аппаратов",["Э1"]).
секция("Системы кондиционирования и жизнеобеспечения",["Э4"]).
секция("Системы управления ракетно-космическими объектами и комплексами летательных аппаратов",["ИУ1"]).
секция("Приборы навигации Кафедра",["ИУ2"]).

секция("Современные радио -, оптические и электронные системы в технике и медицине",["РЛ1","РЛ2","РЛ6"]).
секция("Прикладная механика и компьютерные технологии в автоматизации и робототехнике",["РК4","РК5"]).
секция("Аэрокосмонавтика",["СМ1","СМ2","СМ8"]).
секция("Транспортные машины, системы и оборудование, колесные машины",["СМ9","СМ10"]).
секция("Передовые технологии на транспорте",["РК4","СМ7","СМ9"]).
секция("Машиностроительные технологии, технологии будущего своими руками",["МТ2"]).
секция("Энергетические системы будущего",["Э5"]).
секция("Альтернативные источники энергии",["Э2"]).
секция("Биомедицинская техника",["БМТ1"]).
секция("Интеллектуальные компьютерные системы",["РК6"]).
секция("Физика, лазерные и нанотехнологии",["ФН4"]).
секция("Технологии создания новых материалов",["МТ8"]).
секция("Прикладная математика",["ФН2"]).
секция("Математика и компьютерные науки",["ФН11"]).
секция("Умные машины, интеллектуальные конструкции, робототехника",["РК5"]).
секция("Математика и ее приложения в информационных технологиях",["ФН2", "ФН12"]).

секция("Металлорежущие станки",["МТ1"]).
секция("Инструментальная техника и технологии",["МТ2"]).
секция("Технология машиностроения",["МТ3"]).
секция("Метрология и взаимозаменяемость",["МТ4"]).
секция("Литейные технологии",["МТ5"]).
секция("Технологии обработки давлением",["МТ6"]).
секция("Технологии сварки и диагностики",["МТ7"]).
секция("Материаловедение",["МТ8"]).
секция("Промышленный дизайн",["МТ9"]).
секция("Оборудование и технологии прокатки",["МТ10"]).
секция("Электронные технологии",["МТ11"]).
секция("Лазерные технологии в машиностроении",["МТ12"]).
секция("Технологии обработки материалов",["МТ13"]).
секция("Интеллектуальные системы управления",["ИУ1"]).
секция("Приборы и системы ориентации, стабилизации и навигации",["ИУ2"]).
секция("Наукоемкие технологии в проектировании и производстве электронно-вычислительных и телекоммуникационных систем",["ИУ4"]).
секция("Информационная безопасность",["ИУ8"]).
секция("Оптико-электронные приборы и системы",["РЛ2"]).
секция("Радиоэлектроника",["РЛ1","РЛ6"]).
секция("Биомедицинские технические системы",["БМТ1"]).
секция("Медико-технические информационные технологии",["БМТ2"]).


секция("Машиностроение",["СМ6","СМ9","СМ10"]).
секция("Импульсные технологии в машиностроении",["СМ4"]).
секция("Специальная робототехника и мехатроника",["СМ7"]).
секция("Поршневые двигатели",["Э2"]).
секция("Газотурбинные и нетрадиционные энергоустановки",["Э3"]).
секция("Холодильная и криогенная техника систем кондиционирования и жизнеобеспечения",["Э4"]).
секция("Вакуумная и компрессорная техника",["Э5"]).
секция("Теплофизика",["Э6"]).
секция("Ядерные реакторы и установки",["Э7"]).
секция("Плазменные и энергетические установки",["Э8"]).
секция("Промышленная экология",["Э9"]).
секция("Гидромеханика, гидромашины и гидропневмоавтоматика",["Э10"]).
секция("МПодъемно-транспортные системы. Конструкторское направление",["РК4"]).
секция("Прикладная механика",["РК5"]).
секция("Системы автоматизированного проектирования",["РК6"]).
секция("Компьютерные системы автоматизированного производства",["РК9"]).
секция("Экономика и организация производства",["ИБМ2"]).
секция("Промышленная логистика",["ИБМ3"]).
секция("Менеджмент",["ИБМ4"]).
секция("Финансы",["ИБМ5"]).
секция("Предпринимательство и внешнеэкономическая деятельность",["ИБМ6"]).
секция("Инновационное предпринимательство",["ИБМ7"]).
секция("Физика и познание мира",["ФН4"]).
секция("Прикладная математика",["ФН2"]).




